app/controllers/home_controller.rb

  def index
    @template_categories=TemplateCategory.find(:all,:conditions=>{:enable=>true})
    @templateSliders=Template.order('id desc').page(params[:page]).per(50)
    @products=Product.all
    @projects=Project.order('id desc').page(params[:page]).per(10)
    @questions = Question.order('id desc').page(params[:page]).per(10)
    @notices=Notice.order('id desc').page(params[:page]).per(10)
    @guest_books=GuestBook.order('id desc').page(params[:page]).per(10)

    @maintains=Maintain.order('id desc').page(params[:page]).per(10)
---
SELECT "templates".* FROM "templates" ORDER BY id desc LIMIT 50 OFFSET 0
SELECT "products".* FROM "products"
SELECT "projects".* FROM "projects" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT "questions".* FROM "questions" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT "notices".* FROM "notices" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT "guest_books".* FROM "guest_books" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT "maintains".* FROM "maintains" ORDER BY id desc LIMIT 10 OFFSET 0