app/controllers/maintain_controller.rb

SELECT "maintains".* FROM "maintains" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "maintains"
---
  def index
    @maintain = Maintain.order('id desc').page(params[:page]).per(10)