app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "portfolios"
---
  def index
    @portfolios = Portfolio.order('id desc').page(params[:page]).per(10)