app/controllers/products_controller.rb

  def index
    @products = Product.order('id desc').page(params[:page]).per(10)
---
SELECT "products".* FROM "products" ORDER BY id desc LIMIT 10 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "products" LIMIT 10 OFFSET 0) subquery_for_count