app/controllers/projects_controller.rb

SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "projects" LIMIT 10 OFFSET 0) subquery_for_count
---
  def index
    @projects = Project.order('id desc').page(params[:page]).per(10)