app/controllers/templates_controller.rb

  def index
    @products=Product.find(:all,:conditions=>{:enable=>true})
    @template_categories=TemplateCategory.find(:all,:conditions=>{:enable=>true})
    @template_authors=TemplateAuthor.find(:all,:conditions=>{:enable=>true})

    @templates=Template.joins(:template_author)

    if(params[:template_category_id])
      @templates=@templates.where('template_categories.id IN(?)',params[:template_category_id]).includes(:template_categories)
    end

    if(params[:template_author_id])
      @templates=@templates.where('template_authors.id IN(?)',params[:template_author_id])
    end

    @templates=@templates.order('templates.id desc').includes(:template_type).page(params[:page]).per(60)
---
SELECT "products".* FROM "products" WHERE "products"."enable" = 1
SELECT "template_categories".* FROM "template_categories" WHERE "template_categories"."enable" = 1
SELECT "template_authors".* FROM "template_authors" WHERE "template_authors"."enable" = 1
SELECT "template_types".* FROM "template_types" WHERE "template_types"."id" IN (1)
SELECT "templates".* FROM "templates" INNER JOIN "template_authors" ON "template_authors"."id" = "templates"."template_author_id" ORDER BY templates.id desc LIMIT 60 OFFSET 0
SELECT COUNT(*) FROM "templates" INNER JOIN "template_authors" ON "template_authors"."id" = "templates"."template_author_id"